yuplus/nxp-mcx-series/MCXA366/drivers/fsl_i3c.c
static void I3C_TransferStateMachineIBIWonState(I3C_Type *base,
                                                i3c_master_handle_t *handle,
                                                i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    if (stateParams->masterState == kI3C_MasterStateIbiAck)
    {
        handle->ibiType = I3C_GetIBIType(base);
        if (handle->callback.ibiCallback != NULL)
        {
            handle->callback.ibiCallback(base, handle, handle->ibiType, kI3C_IbiAckNackPending);
        }
        else
        {
            I3C_MasterEmitIBIResponse(base, kI3C_IbiRespNack);
        }
    }

    /* Make sure there is data in the Rx FIFO. */
    if (0UL != stateParams->rxCount)
    {
        if ((handle->ibiBuff == NULL) && (handle->callback.ibiCallback != NULL))
        {
            handle->callback.ibiCallback(base, handle, kI3C_IbiNormal, kI3C_IbiDataBuffNeed);
        }
        uint8_t tempData = (uint8_t)(base->MRDATAB & 0xFFU);
        if (handle->ibiBuff != NULL)
        {
            handle->ibiBuff[handle->ibiPayloadSize++] = tempData;
        }
        (stateParams->rxCount)--;
        return;
    }
    else if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
    {
        handle->ibiType             = I3C_GetIBIType(base);
        handle->ibiAddress          = I3C_GetIBIAddress(base);
        stateParams->state_complete = true;
        stateParams->result         = kStatus_I3C_IBIWon;
    }
    else
    {
        stateParams->state_complete = true;
    }
}

static void I3C_TransferStateMachineSendCommandState(I3C_Type *base,
                                                     i3c_master_handle_t *handle,
                                                     i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    I3C_MasterEnableInterrupts(base, (uint32_t)kI3C_MasterTxReadyFlag);
    /* Make sure there is room in the tx fifo for the next command. */
    if (0UL == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }
    if (handle->transfer.subaddressSize > 1U)
    {
        handle->transfer.subaddressSize--;
        base->MWDATAB = (uint8_t)(((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize)) & 0xFFU);
    }
    else if (handle->transfer.subaddressSize == 1U)
    {
        handle->transfer.subaddressSize--;

        if ((handle->transfer.direction == kI3C_Read) || (0UL == handle->transfer.dataSize))
        {
            base->MWDATABE =
                (uint8_t)(((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize)) & 0xFFU);

            if (handle->transfer.busType != kI3C_TypeI3CDdr)
            {
                if (0UL == handle->transfer.dataSize)
                {
                    handle->state = (uint8_t)kWaitForCompletionState;
                }
                else
                {
                    /* xfer->dataSize != 0U, xfer->direction = kI3C_Read */
                    handle->state = (uint8_t)kWaitRepeatedStartCompleteState;
                }
            }
            else
            {
                handle->state = (uint8_t)kTransferDataState;
            }
        }
        else
        {
            /* Next state, transfer data. */
            handle->state = (uint8_t)kTransferDataState;
            base->MWDATAB =
                (uint8_t)(((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize)) & 0xFFU);
        }
    }
    else
    {
        /* Eliminate misra 15.7*/
    }
}

static void I3C_TransferStateMachineWaitRepeatedStartCompleteState(I3C_Type *base,
                                                                   i3c_master_handle_t *handle,
                                                                   i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    /* We stay in this state until the master complete. */
    if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
    {
        handle->state = (uint8_t)kTransferDataState;
        I3C_MasterDisableInterrupts(base, (uint32_t)kI3C_MasterTxReadyFlag);

        if ((handle->remainingBytes < 256U) && (handle->rxTermOps == kI3C_RxAutoTerm))
        {
            stateParams->result =
                I3C_MasterRepeatedStartWithRxSize(base, handle->transfer.busType, handle->transfer.slaveAddress,
                                                  kI3C_Read, (uint8_t)handle->remainingBytes);
        }
        else
        {
            stateParams->result =
                I3C_MasterRepeatedStart(base, handle->transfer.busType, handle->transfer.slaveAddress, kI3C_Read);
        }
    }

    stateParams->state_complete = true;
}

static void I3C_TransferStateMachineTransferDataState(I3C_Type *base,
                                                      i3c_master_handle_t *handle,
                                                      i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    assert((uintptr_t)(uint8_t *)handle->transfer.data < UINT32_MAX);

    uint8_t *dataBuff = (uint8_t *)handle->transfer.data;

    if (handle->transfer.direction == kI3C_Write)
    {
        /* Make sure there is room in the tx fifo. */
        if (0UL == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Put byte to send in fifo. */
        if (handle->remainingBytes > 1U)
        {
            base->MWDATAB = *dataBuff;
        }
        else
        {
            base->MWDATABE = *dataBuff;
        }
    }
    else
    {
        /* Make sure there is data in the rx fifo. */
        if (0UL == (stateParams->rxCount)--)
        {
            if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
            {
                handle->state = (uint8_t)kWaitForCompletionState;
            }
            else
            {
                stateParams->state_complete = true;
            }
            return;
        }

